G_PROJECT_ID = 'plated-monolith-425409-f3'
CITY_NAME_CHITA = "chita"
CITY_COORDINATES_CHITA = (52.033635, 113.501049)
DISTANCES_KM = [10, 20, 30, 50, 100, 150, 200]
BEARINGS_DEG = [0, 45, 90, 135, 180, 225, 270, 315]
YEARS_TO_ANALYZE = [2019, 2020, 2021, 2022, 2023, 2024]
MONTH_TO_ANALYZE = 2
EARTH_RADIUS_KM = 6371
GEE_NO2_COLLECTION = "COPERNICUS/S5P/OFFL/L3_NO2"
GEE_COLLECTION_SCALE = 1113.2
MOL_PER_M2_TO_UMOL_PER_M2 = 10 ** 6
EXPORTS_FOLDER = "exports"
CITIES = {
    "Москва": (55.7558, 37.6173),
    "Санкт-Петербург": (59.9343, 30.3351),
    "Новосибирск": (55.0301, 82.9204),
    "Екатеринбург": (56.8380, 60.5975),
    "Казань": (55.7961, 49.1064),
    "Нижний Новгород": (56.3269, 44.0059),
    "Челябинск": (55.1644, 61.4025),
    "Самара": (53.1959, 50.1002),
    "Омск": (54.9894, 73.3686),
    "Ростов-на-Дону": (47.2221, 39.7188),
    "Уфа": (54.7351, 55.9587),
    "Красноярск": (56.0105, 92.8526),
    "Воронеж": (51.6615, 39.2003),
    "Пермь": (58.0105, 56.2502),
    "Волгоград": (48.7071, 44.5169),
    "Чита": (52.0336, 113.5010),
}